
% 
% gcf1 = figure(1);
% data = [4.7909, 4.1394; 2.9534, 4.0809;8.2948,4.1383;3.8153,4.1157;27.4451,4.0243];
% b = bar(data);
% 
% ch = get(b,'children');
% 
% set(gca,'XTickLabel',{'1-2','1-3','1-4','1-5','1-6'})
% 
% legend('MPGA','BnB','Location','North');
% 
% ylabel('Time spent (s)');



%graf
% m1 = [5.9083,3.2782,1.8717,0,0];% memory DM
% m2 = [1.5726,1.5735,1.5887,0,0];% memory 
% m3 = [1.5371,1.5365,1.5407,0,0];% memory
% t1 = [70.478,17.6614,7.1634,0,0];% Time DM
% t2 = [5.2316,82.8228,210,0,0];% Time 
% t3 = [1.6374,1.3517,3.3317,0,0];% Time 
%wall
% m1 = [6.2383,5.7778,6.3739,2.5871,0];% memory DM
% m2 = [1.6356,1.6356,1.6301,1.6353,0];% memory 
% m3 = [1.5415,1.5447,1.5447,1.5447,0];% memory 
% t1 = [86.3306,128.055,62.0876,16.3051,0];% Time DM
% t2 = [3.8158,4.7167,10.8673,0.5586,0];% Time 
% t3 = [1.7121,1.0695,1.0019,1.5275,0];% memory 
%bark
% m1 = [6.2842,5.0747,3.5452,2.8824,2.3868];% memory DM
% m2 = [1.643,1.6503,1.6551,1.6298,1.6362];% memory 
% m3 = [1.5437,1.5414,1.5414,1.5414,1.5414];% memory
% t1 = [131.1862,62.4414,24.478,19.7284,15.6583];% Time DM
% t2 = [3.9212,1.7479,0.7444,0.2816,0.2924];% Time 
% t3 = [0.7667,1.0895,1.253,1.0729,0.8582];% Time 
% %trees
% m1 = [6.2832,4.822,6.1419,4.4343,2.9482];% memory DM
% m2 = [1.6491,1.6381,1.6491,1.6409,1.6489];% memory 
% m3 = [1.5431,1.5459,1.5459,1.5459,1.5459];% memory 
% t1 = [148.828,114.8159,63.7727,33.075,18.2308];% Time DM
% t2 = [86.28,20.9274,158.6857,205.3141,200.3527];% Time 
% t3 = [1.2377,2.1086,1.6083,1.0136,1.0266];% memory 
%bikes
m1 = [5.9911,5.8817,5.9446,6.2843,5.3136];% memory DM
m2 = [1.6441,1.6543,1.6504,1.6582,1.6485];% memory 
m3 = [1.5459,1.5459,1.5459,1.5459,1.5459];% memory 
t1 = [210,126.2802,72.5608,120.4307,84.029];% Time DM
t2 = [3.8679,4.8449,3.6489,8.5152,29.3872];% Time 
t3 = [1.4976,1.0155,1.1404,1.3026,1.0436];% memory 
%leuven
% m1 = [6.0038,5.4764,5.0922,6.1495,5.9064];% memory DM
% m2 = [1.6517,1.6596,1.6328,1.6391,1.6453];% memory 
% m3 = [1.545,1.5438,1.5438,1.5438,1.5438];% memory
% t1 = [151.2707,196.7747,192.7205,110.6057,167.0074];% Time DM
% t2 = [3.6874,3.7697,6.3375,6.0758,9.0284];% Time 
% t3 = [1.1564,1.4092,1.3344,0.9457,1.3876];% Time 
%ubc
% m1 = [6.0176,5.9967,5.1331,6.335,4.3676];% memory DM
% m2 = [1.6301,1.6389,1.6454,1.6261,1.6355];% memory 
% m3 = [1.5437,1.5435,1.5435,1.5435,1.5435];% memory 
% t1 = [100.4093,74.6078,53.5653,74.5876,29.4992];% Time DM
% t2 = [3.3689,3.3499,2.5558,35.8798,16.8665];% Time 
% t3 = [0.7706,1.0731,1.5153,1.4762,1.0299];% memory 
%homogr
% m1 = [2.9397,1.6866,6.4427,6.5657,3.6774];% memory DM
% m2 = [1.398,1.4247,1.4889,1.5244,1.5078];% memory 
% m3 = [1.5268,1.5284,1.5415,1.5478,1.5418];% memory 
% t1 = [18.582,10.7679,135.7344,107.1645,18.6955];% Time DM
% t2 = [1.9628,0.1803,4.2565,200.4216,14.4969];% Time 
% t3 = [0.9666,0.6825,1.7262,1.3008,1.7752];% memory 

 

x=1:1:5;%x轴上的数据，第一个值代表数据开始，第二个值代表间隔，第三个值代表终止
plot(x,t1,'--*b',x,t2,'-*g',x,t3,'--^r'); %线性，颜色，标记
axis([1,5,0,210])  %确定x轴与y轴框图大小
set(gca,'XTick',[1:1:5]) %x轴范围1-6，间隔1
set(gca,'YTick',[0:30:210]) %y轴范围0-700，间隔100
grid on;
legend('GMD','Astar','Ours');   %右上角标注s
% ylabel('Memory usage (GB)') %y轴坐标描述
ylabel('Time spent (s)');

% set(h1(1),'LineStyle','--','Marker','*','MarkerSize',5,'Color','b');
% set(h1(2),'LineStyle','-','Marker','^','MarkerSize',5,'Color','b');
% set(ax(1),'ytick',(0:1:8));
% set(gca,'XTickLabel',{'1-2','1-3','1-4','1-5'})
% legend('Memory usage(IRE)','Memory usage(Ours)');
% set(get(ax(1),'Ylabel'),'String','Memory usage (GB)','linewidth',2.2);


% 
% y1 = [0.55,0.71,0.89,1.17,2.43,3.94,6.57];
% y2 = [0.61,0.81,1.25,1.63,3.21,5.43,7.67];
% y11 = [0.7,2.1,4.5,6.9,11.1,132,241.4];
% y21 = [1.6,3.5,5.9,8.1,20.4,231.4,381.1];

% y1 = [0.61,0.85,1.03,1.35,2.57,4.08,6.72];
% y2 = [0.67,0.95,1.34,2.11,3.93,5.81,7.83];
% y11 = [0.6,1.13,2.3,3.3,4.4,5.7,9.9];
% y21 = [0.9,2.1,3.05,4.1,5.3,6.7,9.9];
% gcf1 = figure(1);
% [ax,h1,h2]=plotyy(x,[m1;m2],x,[t1;t2]);
% set(h1(1),'LineStyle','--','Marker','*','MarkerSize',5,'Color','b');
% set(h1(2),'LineStyle','-','Marker','^','MarkerSize',5,'Color','b');
% set(h2(1),'LineStyle','--','Marker','*','MarkerSize',5,'Color','r')
% set(h2(2),'LineStyle','-','Marker','^','MarkerSize',5,'Color','r')
% set(ax(1),'Ycolor','b');
% set(ax(2),'Ycolor','r');
% set(ax(1),'ytick',(0:1:8));
% set(ax(2),'ytick',(0:30:330));
% set(gca,'XTickLabel',{'1-2','1-3','1-4','1-5'})
% set(get(ax(1),'Ylabel'),'String','Memory usage (GB)','linewidth',2.2);
% set(get(ax(2),'Ylabel'),'String','Time spent (s)','linewidth',2.2);
% legend('Memory usage(IRE)','Memory usage(Ours)','Time usage(IRE)','Time usage(Ours)');
% grid on;
% set(ax(1),'box','off')
% set(ax(2),'box','off')
% create a new axes on top of old ones
% new_AX = axes('Position',get(ax(1),'Position'),'XLim',get(ax(1),'XLim'),'YTick',[]);
% set(new_AX,'box', 'on')
% reorder things to make y-axes and box visible at the same time
% uistack(ax(1),'top')
% uistack(ax(2),'top')
% set(ax(1),'Color','None')

% print(gcf1, ['grafTimeMem.tif'], '-r300', '-dtiff');